# FSActLayer

## Description
Function FSActLayer returns a handle to the first selected object on the active layer. If no objects are selected, the function returns NIL.

```pascal
FUNCTION FSActLayer : HANDLE;
```

```python
def vs.FSActLayer():
    return HANDLE
```

## Examples
```pascal
resultH := FSActLayer;
```
```python
import vs

# Function FSActLayer returns a handle to the first selected object on the
# active layer.
objHandle = vs.FSActLayer()
if objHandle is not None:
    vs.Message('Created object handle: ' + str(objHandle))
```
See also in tutorials: 20. Read a Polyline and Build Walls Along Its Path

## See Also
Relative calls:
* NextObj | PrevObj
* FObject | LObject
* FSActLayer | LSActLayer
* FSObject  | LActLayer
* NextDObj | PrevDObj
* NextSObj | PrevSObj

## Version
Availability: from All Versions

## Category
* Document List Handling